ERP.belugaerp/src/DataProcessors/бг_РаспределениеМатериалов/бг_РаспределениеМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_РаспределениеМатериалов</name>
</mdclass:DataProcessor>

ERP.belugaerp/src/AccumulationRegisters/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВыпускПродукции</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДатаОтгрузкиВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаНазначения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НазначениеМатериалы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РасходОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ПроизводственнаяЛиния</name>
      <type>
        <types>CatalogRef.бг_ПроизводственныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Произведено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ДополнительныйРасход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямПродукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/РаспределениеПроизводственныхЗатрат/РаспределениеПроизводственныхЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РаспределениеПроизводственныхЗатрат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ПартииПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ПартияПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Этап</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/DataProcessors/бг_РаспределениеМатериалов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АдресМатериалыКРаспределению") Тогда
		ЗаполнитьМатериалыКРаспределению(Параметры.АдресМатериалыКРаспределению);
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Период = Параметры.Период;
		ОтборПартииПроизводстваПериод.ДатаНачала = НачалоМесяца(Параметры.Период);
		ОтборПартииПроизводстваПериод.ДатаОкончания = КонецМесяца(Параметры.Период);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборПартииПроизводстваПериодПриИзменении(Элемент)
	ЗаполнитьБазуРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПродукцияПриИзменении(Элемент)
	ЗаполнитьБазуРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОтметкаМатериалыПриИзменении(Элемент)
	СтруктураОтбора = Новый Структура();
	
	Если ФильтрОтметкаМатериалы Тогда
		СтруктураОтбора.Вставить("ТребуетсяРаспределить", Истина);
	КонецЕсли;
	
	Элементы.Материалы.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	Если Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1 Тогда
		Если ПроверитьЗаполнениеСтатьиКалькуляции()
			И РассчитатьОрганизациюМатериалыКРаспределению() Тогда
			ЗаполнитьБазуРаспределения();
			
			Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2;
			Элементы.СтраницыКомандыНиз.ТекущаяСтраница = Элементы.СтраницаКомандыНизШаг2;
		КонецЕсли;
	ИначеЕсли Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда
		Если ВыбранаБазаРаспределения() Тогда
			СформироватьДокументыРаспределения();
			
			Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3;
			Элементы.СтраницыКомандыНиз.ТекущаяСтраница = Элементы.СтраницаКомандыНизШаг3;
		Иначе
			ТекстСообщение = НСтр("ru = 'Не выбрана база распределения'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщение);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовокФормы(Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда
		Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1;
		Элементы.СтраницыКомандыНиз.ТекущаяСтраница = Элементы.СтраницаКомандыНизШаг1;
	КонецЕсли;
	
	УстановитьЗаголовокФормы(Элементы.СтраницыОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеМатериалы(Команда)
	УстановитьОтметкуВыборМатериалов(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СброситьВыборМатериалов(Команда)
	УстановитьОтметкуВыборМатериалов(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеСтрокиБазыРаспределения(Команда)
	УстановитьОтметкуВыборБазыРаспределения(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СброситьВыборСтрокБазыРаспределения(Команда)
	УстановитьОтметкуВыборБазыРаспределения(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатьиКалькуляции(Команда)
	СтатьяКалькуляции = Неопределено;
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьСтатьиКалькуляцииВТабличнойЧастиЗавершение",
		ЭтотОбъект, Новый Структура("ВыделенныеСтроки, ТабЧасть", Элементы.Материалы.ВыделенныеСтроки, Материалы));
	
	ОткрытьФорму("Справочник.СтатьиКалькуляции.ФормаВыбора", , ЭтотОбъект, , , ,
						Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеСформированныеДокументы(Команда)
	ВыделенныеСтроки = Элементы.ДокументыРаспределения.ВыделенныеСтроки;
	ПометитьНаУдалениеСформированныеДокументыНаСервере(ВыделенныеСтроки);
	
	Элементы.ДокументыРаспределения.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыСтатьяКалькуляции.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Материалы.ТребуетсяРаспределить");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Материалы.СтатьяКалькуляции");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы(Страница)
	
	Если Страница = Элементы.СтраницаШаг1 Тогда
		
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru = 'Шаг 1 из 3. Отбор материалов'");
		
	ИначеЕсли Страница = Элементы.СтраницаШаг2 Тогда
		
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru = 'Шаг 2 из 3. Выбор базы распределения'");
		
	ИначеЕсли Страница = Элементы.СтраницаШаг3 Тогда
		
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru = 'Шаг 3 из 3. Уточнение сформированных документов распределения'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыКРаспределению(АдресМатериалыКРаспределению)
	МатериалыКРаспределению = ПолучитьИзВременногоХранилища(АдресМатериалыКРаспределению);
	Для Каждого СтрокаМатериал Из МатериалыКРаспределению Цикл
		Если СтрокаМатериал.Наличие = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаМатериал = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаМатериал, СтрокаМатериал);
		НоваяСтрокаМатериал.Распределить = СтрокаМатериал.Наличие;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкуВыборМатериалов(Значение)
	ВыделенныеСтроки = Элементы.Материалы.ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Материалы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		СтрокаТаблицы.ТребуетсяРаспределить = Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкуВыборБазыРаспределения(Значение)
	ВыделенныеСтроки = Элементы.ПартииПроизводства.ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = ПартииПроизводства.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		СтрокаТаблицы.ТребуетсяРаспределить = Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеСтатьиКалькуляции()
	Отбор = Новый Структура("ТребуетсяРаспределить, СтатьяКалькуляции", Истина, Справочники.СтатьиКалькуляции.ПустаяСсылка());
	
	МатериалыУказатьСтатьюКалькуляции = Материалы.Выгрузить(Отбор, "Номенклатура, СтатьяКалькуляции");
	Для Каждого СтрокаМатериал Из МатериалыУказатьСтатьюКалькуляции Цикл
		ТекстСообщения = НСтр("ru = 'Для материала ""%1"" требуется указать статью калькуляции'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаМатериал.Номенклатура);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Возврат МатериалыУказатьСтатьюКалькуляции.Количество() = 0;
КонецФункции

&НаСервере
Функция РассчитатьОрганизациюМатериалыКРаспределению()
	Отбор = Новый Структура("ТребуетсяРаспределить", Истина);
	
	РаспределяемыеМатериалы = Материалы.Выгрузить(Отбор, "Организация");
	РаспределяемыеМатериалы.Свернуть("Организация");
	
	Если РаспределяемыеМатериалы.Количество() = 0 Тогда
		ТекстСообщение = НСтр("ru = 'Не выбраны материалы к распределению'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщение);
		Возврат Ложь;
	ИначеЕсли РаспределяемыеМатериалы.Количество() > 1 Тогда
		ТекстСообщение = НСтр("ru = 'Необходимо выбрать материалы к распределению по одной организации'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщение);
		Возврат Ложь;
	КонецЕсли;
	
	Организация = РаспределяемыеМатериалы[0].Организация;
	
	Возврат Истина;
КонецФункции

&НаСервере
Функция ВыбранаБазаРаспределения()
	Отбор = Новый Структура("ТребуетсяРаспределить", Истина);
	
	Возврат ПартииПроизводства.НайтиСтроки(Отбор).Количество() > 0;
КонецФункции

&НаСервере
Процедура ЗаполнитьБазуРаспределения()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыпускПродукцииОбороты.Распоряжение КАК Распоряжение,
	|	ВЫРАЗИТЬ(ВыпускПродукцииОбороты.Распоряжение КАК Документ.ЭтапПроизводства2_2).Спецификация КАК Спецификация,
	|	ВЫРАЗИТЬ(ВыпускПродукцииОбороты.Распоряжение КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства КАК ПартияПроизводства,
	|	ВЫРАЗИТЬ(ВыпускПродукцииОбороты.Распоряжение КАК Документ.ЭтапПроизводства2_2).Подразделение КАК Подразделение,
	|	ВыпускПродукцииОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВыпускПродукцииОбороты.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ВыпускПродукцииОбороты.КоличествоОборот КАК Коэффициент,
	|	ИСТИНА КАК ТребуетсяРаспределить
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И (НЕ &ОтборПоПродукции
	|					ИЛИ АналитикаУчетаНоменклатуры.Номенклатура В (&Продукция))) КАК ВыпускПродукцииОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыпускПродукцииОбороты.АналитикаУчетаНоменклатуры.Номенклатура.Наименование";
	Запрос.УстановитьПараметр("НачалоПериода", ОтборПартииПроизводстваПериод.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтборПартииПроизводстваПериод.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтборПоПродукции", ОтборПродукция.Количество() > 0);
	Запрос.УстановитьПараметр("Продукция", ОтборПродукция.ВыгрузитьЗначения());
	
	Результат = Запрос.Выполнить();
	ПартииПроизводства.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыРаспределения()
	СформированныеДокументы = Новый Массив;
	
	ОтборБазаРаспределения = Новый Структура("ТребуетсяРаспределить", Истина);
	БазаРаспределения = ПартииПроизводства.Выгрузить(ОтборБазаРаспределения);
	
	Для Каждого СтрокаМатериал Из Материалы Цикл
		Если Не СтрокаМатериал.ТребуетсяРаспределить Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаполнения = СтруктураДанныеЗаполнения(Период);
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СтрокаМатериал);
		
		НовыйДокументРаспределения = Документы.РаспределениеПроизводственныхЗатрат.СоздатьДокумент();
		НовыйДокументРаспределения.Заполнить(ДанныеЗаполнения);
		НовыйДокументРаспределения.Количество   = СтрокаМатериал.Распределить;
		НовыйДокументРаспределения.Распределить = 0;
		
		бг_РаспределениеПроизводственныхЗатрат.бг_РаспределитьМатериалыПоПартиямПроизводства(
														НовыйДокументРаспределения,
														НовыйДокументРаспределения.Количество,
														БазаРаспределения,
														СтрокаМатериал.СтатьяКалькуляции);
		
		Попытка
			НовыйДокументРаспределения.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			
			НовыйДокументРаспределения.Записать();
		КонецПопытки;
		
		СформированныеДокументы.Добавить(НовыйДокументРаспределения.Ссылка);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыРаспределения, "Ссылка", СформированныеДокументы,
											ВидСравненияКомпоновкиДанных.ВСписке);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтруктураДанныеЗаполнения(Период)
	
	СтруктураДокумента = Новый Структура("НовоеПроизводство, Дата, Организация, Подразделение, АналитикаУчетаНоменклатуры,
	|Склад, Номенклатура, Характеристика, Серия, СтатусУказанияСерий, Назначение, Ссылка, Распределить");
	
	СтруктураДокумента.НовоеПроизводство = Истина;
	СтруктураДокумента.Дата = КонецМесяца(Период);
	
	Возврат СтруктураДокумента;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСтатьиКалькуляцииВТабличнойЧастиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	ТабЧасть = ДополнительныеПараметры.ТабЧасть;
	СтатьяКалькуляции = Результат;
	
	Если Не ЗначениеЗаполнено(СтатьяКалькуляции) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТабЧасть.НайтиПоИдентификатору(Строка);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.СтатьяКалькуляции = СтатьяКалькуляции;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьНаУдалениеСформированныеДокументыНаСервере(СписокДокументы)
	Попытка
		ОбщегоНазначенияУТ.УстановитьПометкуУдаленияДокументов(СписокДокументы);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
